In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('titanic.csv')

In [4]:
list(df.columns)

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [5]:
df.loc[99]

PassengerId                  100
Survived                       0
Pclass                         2
Name           Kantor, Mr. Sinai
Sex                         male
Age                         34.0
SibSp                          1
Parch                          0
Ticket                    244367
Fare                        26.0
Cabin                        NaN
Embarked                       S
Name: 99, dtype: object

In [6]:
df.loc[5, 'Age'] = '27'
df.loc[5]

PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                          27
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

In [7]:
(pd.to_numeric(df["Age"]) > 18).sum()

576

In [8]:
((df["Sex"] == 'male').sum())/len(df)*100

64.75869809203144

In [9]:
df['Pclass'].value_counts().sort_index().reset_index(name='Number of Passengers').rename(columns={'index': 'Class'})

   Class  Number of Passengers
0      1                   216
1      2                   184
2      3                   491

In [10]:
(df['Embarked'].value_counts(normalize=True) * 100).reset_index().rename(columns={'index': 'Embarked', 'Embarked': 'Percentage of Passengers'})

  Embarked  Percentage of Passengers
0        S                 72.440945
1        C                 18.897638
2        Q                  8.661417

In [48]:
df[df['PassengerId'] == 5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [25]:
df[df['Name'].str.contains('Fannie')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
706,707,1,2,"Kelly, Mrs. Florence ""Fannie""",female,45.0,0,0,223596,13.5,NaN,S

In [59]:
numMale = 0
numFemale = 0
survivorsMale = 0
survivorsFemale = 0
for i in range(len(df)):
    if df.loc[i, 'Sex'] == 'male':
        numMale += 1
        if df.loc[i,'Survived'] == 1:
            survivorsMale += 1
    else:
        numFemale += 1
        if df.loc[i, 'Survived'] == 1:
            survivorsFemale += 1
pd.DataFrame({'Male': [numMale, survivorsMale,int(survivorsMale/numMale*100)], 'Female': [numFemale, survivorsFemale,int(survivorsFemale/numFemale*100)]}, index=['Total', 'Survivors', 'Percent Survived'])

                  Male  Female
Total              577     314
Survivors          109     233
Percent Survived    18      74